Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དབྱར་ཟླ་འབྲིང་པོ་ལ་དབྱར་གནས་པའི་དུས་ལ་བབ་པ་དེའི་ཚེ་ནི། དགེ་སློང་དག་གིས་ཡིད་ལ་བྱེད་པའི་ལུང་མནོས་ནས།
en: When the time comes in the middle of the summer months for the monks to enter the rains retreat, the monks receive instructions to ponder,

source: རིའི་སུལ་དང་རིའི་ཕུག་དང་སོག་མའི་ཕུག་དང་ཐང་དང་དུར་ཁྲོད་དང་ནགས་ཁྲོད་ཀྱི་གནས་དེ་དག་ཏུ་དབྱར་གནས་པར་དམ་འཆའ་བར་བྱེད་དོ། །
en: and then they pledge to remain for the duration of the summer in mountain ravines, in mountain caves, in caves of reeds, on the plains, in charnel grounds, or in the forests.

source: སྟོན་ཟླ་ཐ་ཆུངས་ཉ་ལ་ནི་དེ་ནས་དོང་སྟེ། རྟོགས་པ་ནི་རྗོད་པར་བྱེད་ལ་མ་རྟོགས་པ་ནི་གོང་དུ་འདྲི་བར་བྱེད་དོ། །
en: Then, when the full moon of the last month of autumn arrives, they give an account of all that they have realized, and they put questions to their superiors regarding all that they still do not understand.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་གཉིས་ཀྱི་འཁོར་ལྔ་བརྒྱ་དང་ཚེ་དང་ལྡན་པ་བྲམ་ཟེ་ཀ་པི་ན་ཆེན་པོའི་འཁོར་ལྔ་བརྒྱ་པོ་དེ་དག་དབྱར་གནས་པར་བྱས་ཏེ
en: The five hundred in each of Venerable Śāriputra and Venerable Maudgalyāyana’s two retinues and the five hundred of Venerable Brāhmaṇa Mahā­kapina’s retinue all entered summer retreat.

source: དབྱར་གནས་ཟིན་ནས་དབྱར་ཟླ་གསུམ་འདས་པའི་འོག་ཏུ་ཆོས་གོས་བྱས་ཏེ་ཆོས་གོས་ཟིན་ནས། ཆོས་གོས་གྱོན་ཏེ་ལྷུང་བཟེད་ཐོགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: When three months had passed and their summer retreat was finished, they donned their lower garments and Dharma robes, and, carrying their alms bowls, they went to see the Blessed One. Upon their arrival they touched their heads to the Blessed One’s feet, and took seats at one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་དགེ་སློང་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་རྟོགས་པ་ནི་རྗོད་པར་བྱེད་མ་རྟོགས་པ་ཡན་ཅད་ནི་ཞུ་བར་བྱེད་དོ། །
en: After they had taken their seats at one side, they gave the Blessed One an account of all that they had realized, and put questions to him regarding all that they still did not understand.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་གོང་མའི་ཡིད་ལ་བྱེད་པའི་ལུང་ཕོག་ནས། དེ་དག་གིས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: The Blessed One gave them more advanced instructions to ponder, and they cast away all afflictive emotions with diligence, practice, and effort, and manifested arhatship.

source: དེ་ནས་དགེ་སློང་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: The monks asked the Blessed One,

source: བཙུན་པ་ཚེ་དང་ལྡན་པ་བྲམ་ཟེ་ཀ་པི་ན་ཆེན་པོས་ནི་དགེ་སློང་ལྔ་བརྒྱ་པོ་འདི་རྣམས་དགྲ་བཅོམ་པ་ཉིད་ལ་བཀོད་ལ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་བཀོད་དོ། །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྡེ་ཚན་དང་ལྡན་པ་གཉིས་པར་གྱུར་པས་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་བཀོད་པ་ལ་གཟིགས།
en: “Lord, tell us why Venerable Brāhmaṇa Mahā­kapina, Venerable Maudgalyāyana, and Venerable Śāriputra established five hundred monks in arhatship, in the resultant state of non-return, and in the resultant state of stream entry.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ་
en: “Not only now, monks” the Blessed One explained,

source: འདས་པའི་དུས་ན་ཡང་དགེ་སློང་ཀ་པི་ནས་དགེ་སློང་ལྔ་བརྒྱ་པོ་འདི་དག་ཉིད་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་ཇི་ལྟར་བཀོད་པ་དང་། མཽད་གལ་གྱི་བུས་གཟུགས་མེད་པའི་ཁམས་སུ་ཇི་ལྟར་བཀོད་པ་དང་། ཤཱ་རིའི་བུས་གཟུགས་ཀྱི་ཁམས་སུ་ཇི་ལྟར་བཀོད་པ་དེ་ཉོན་ཅིག །
en: “but in times past as well, and in the same way, Venerable Brāhmaṇa Mahā­kapina, Venerable Maudgalyāyana, and Venerable Śāriputra, respectively, established their five hundred monks in the four meditative states and five superknowledges, in the formless realm, and in the form realm. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རི་ཞིག་ལ་དྲང་སྲོང་གཡོག་འཁོར་ལྔ་བརྒྱ་ལྔ་བརྒྱ་དང་ལྡན་པ་གཉིས་བརྟེན་ཅིང་འདུག་སྟེ།
en: “Monks, in times gone by, on a certain mountain there lived two sages, each with five hundred devotees.

source: རི་ངོས་གཅིག་ན་ནི་དྲང་སྲོང་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་ལྡན་པ་གཅིག་འདུག་གོ། །
en: One sage lived on one side of the mountain with his five hundred devotees,

source: ཕ་རོལ་གྱི་ངོས་ན་ནི་དྲང་སྲོང་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་ལྡན་པ་གཅིག་འདུག་གོ། །
en: and the other lived on the other side of the mountain with his five hundred devotees.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་གཉིས་ལས་དྲང་སྲོང་གཅིག་ཤི་ནས།
en: One day, one of the sages passed away.

source: བྲམ་ཟེའི་ཁྱེའུ་དེ་དག་གིས་དེའི་རུས་བུ་ལ་རུས་བུའི་མཆོད་པ་བྱས་ནས་དྲང་སྲོང་ཅིག་ཤོས་ཀྱི་ཐད་དུ་དོང་ངོ་། །
en: After the young brahmins made offerings to his relics, they went to see the other sage,

source: དྲང་སྲོང་དེས་ཀྱང་དེ་དག་འཁོར་དུ་བྱས་ནས་
en: and the other sage brought them into his retinue.

source: དྲང་སྲོང་དེས་བསམས་པ།
en: Then the thought occurred to the sage,

source: མ་ལ་བདག་ཀྱང་ཤི་ན་ནི་བྲམ་ཟེའི་ཁྱེའུ་འདི་རྣམས་མགོན་མེད་པར་འགྱུར་གྱིས།
en: ‘After I pass away, there will be no one to look after these young men.

source: བདག་གསོན་པའི་ཚེ་ན་འདི་རྣམས་བསྐྱང་བར་བྱ་དགོས་སོ་སྙམ་ནས་
en: I must see to their needs while I’m still alive.’

source: དྲང་སྲོང་དེ་ལ་སློབ་མའི་མཆོག་གསུམ་ཡོད་པ་དེ་ལས་གཅིག་ལ་ནི་དྲང་སྲོང་དེས་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་གཏད་དོ། །
en: “Now, this sage had three outstanding students, so he entrusted five hundred young brahmins to one of them

source: གཉིས་ལ་ནི་ཉིས་བརྒྱ་ལྔ་བཅུ་ཉིས་བརྒྱ་ལྔ་བཅུ་གཏད་དོ། །
en: and entrusted two hundred and fifty to each of the other two.

source: འདི་སྐད་ཅེས་ཀྱང་བསྒོ་སྟེ།
en: Then he told them,

source: བདག་གསོན་པའི་ཚེ་ཡང་རུང་ཤི་བའི་འོག་ཏུ་ཡང་རུང་སྟེ་ཁྱེད་ཀྱིས་འདི་རྣམས་སློབས་ཤིག །ཡིད་ལ་བྱེད་པ་ལ་ཡང་ཡང་དག་པར་བཟུང་བར་གྱིས་ཤིག་ཅེས་བྱས་སོ། །
en: ‘Both while I am living and after my death, you must teach these disciples and see to it that they also ponder the instructions.’

source: དེ་ནས་དེ་དག་གི་ནང་ནས་གཅིག་གིས་ནི་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་ཡང་དག་པར་བཀོད་དོ། །
en: One of the three established his five hundred young brahmins in the four meditative states and five superknowledges,

source: གཅིག་གིས་ནི་གཟུགས་མེད་ང་པའི་ཁམས་སུ་བཀོད་དོ། །
en: one established his two hundred and fifty in the formless realm,

source: གཅིག་གིས་ནི་གཟུགས་ཀྱི་ཁམས་སུ་བཀོད་དོ། །
en: and one established his two hundred and fifty in the form realm.

source: དེའི་ཚེ་གང་གིས་བྲམ་ཟེའི་ཁྱེའུ་དེ་དག་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་པ་དེ་ནི་བྲམ་ཟེ་ཀ་པི་ན་འདི་ཉིད་ཡིན་ནོ། །
en: The one who placed those young brahmins in the four meditative states and five superknowledges then is none other than Brāhmaṇa Kapina.

source: གང་གིས་དེ་དག་གཟུགས་མེད་པའི་ཁམས་སུ་བཀོད་པ་དེ་ནི་མཽད་གལ་གྱི་བུ་འདི་ཉིད་ཡིན་ནོ། །
en: The one who placed them in the formless realm then is none other than Maudgalyāyana.

source: དེའི་ཚེ་གང་གིས་དེ་དག་གཟུགས་ཀྱི་ཁམས་སུ་བཀོད་པ་དེ་ནི་ཤཱ་རིའི་བུ་འདི་ཉིད་ཡིན་ཏེ།
en: And the one who placed them in the form realm then is none other than Śāriputra.

source: དེའི་ཚེ་ཡང་དེ་རྣམས་ལས་འདི་དག་ཉིད་ལས་གཅིག་གིས་ནི་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་དོ། །
en: “At that time, one of them placed them in the four meditative states and five superknowledges,

source: གཅིག་གིས་ནི་གཟུགས་མེད་པའི་ཁམས་སུ་བཀོད་དོ། །
en: one of them placed them in the formless realm,

source: ད་ལྟར་ཡང་འདི་རྣམས་ལས་གཅིག་གིས་ནི་དགྲ་བཅོམ་པ་ཉིད་ལ་བཀོད་དོ། །
en: and so too now one has placed them in arhatship,

source: གཅིག་གིས་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་བཀོད་དོ། །
en: one has placed them in the resultant state of non-return,

source: གཅིག་གིས་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་བཀོད་དོ། །
en: and one has placed them in the resultant state of stream entry.

source: གཞན་ཡང་དགེ་སློང་དག་བྲམ་ཟེ་ཀ་པི་ནའི་སློབ་མ་གང་ཡིན་པ་དེ་དག་ནི་དབང་པོ་རྣོན་པོ་ཡིན་ནོ། །
en: “Furthermore, monks, Brāhmaṇa Kapina’s students have keen intelligence,

source: མཽད་གལ་གྱི་བུའི་སློབ་མ་གང་ཡིན་པ་དེ་དག་ནི་དབང་པོ་འབྲིང་ངོ་། །
en: Maudgalyāyana’s students are of average intelligence, and Śāriputra’s students are less intelligent.

source: ཤཱ་རིའི་བུའི་སློབ་མ་གང་ཡིན་པ་དེ་དག་ནི་དབང་པོ་རྟུལ་པོ་ཡིན་ཏེ། དགེ་སློང་དག་གལ་ཏེ་ཤཱ་རིའི་བུའི་སློབ་མ་གང་ཡིན་པ་དེ་དག་བྲམ་ཟེ་ཀ་པི་ན་ལ་གཏད་དུ་ཟིན་ན། དྲོ་བར་གྱུར་པ་ཡང་དེ་དག་གིས་བསྐྱེད་མི་ནུས་ན། གོང་མའི་ཁྱད་པར་རྟོགས་པ་ལྟ་ག་ལ་འགྱུར།
en: Monks, if Śāriputra’s students could not so much as generate heat when handed to Brāhmaṇa Kapina, how then could they have realizations of a higher order?”

source: དེ་ནས་དགེ་སློང་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: The monks asked the Blessed Buddha,

source: བཙུན་པ་དྲང་སྲོང་ཀ་ནེ་ཡ་དང་རི་བོ་གཡོག་འཁོར་དང་བཅས་པ་གཉིས་ཀྱིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་འདི་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་བགྱིས་ལགས།
en: “Lord, what actions did the sages Kaineya and Śaila and their devotees take that ripened such that they pleased and did not displease the Blessed One, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: འདི་གཉིས་ཀྱིས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “When did they make these prayers?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་མཛའ་ཞིང་བཤེས་ལ་གཅུགས་པ་གཉིས་ཤིག་འཁོད་པ་ལས། ཕྱི་ཞིག་ན་དེ་གཉིས་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནསདེ་གཉིས་ཀྱིས་ཁྱིམ་གྱི་འཁོར་བཏང་སྟེ་གཉི་ག་རབ་ཏུ་བྱུང་ངོ་། །
en: there lived two householders in Vārāṇasī who were very close friends. “One day they found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa, gave up household affairs, and went forth.

source: རབ་ཏུ་བྱུང་ནས་དེ་གཉིས་ཀྱིས་སྡེ་སྣོད་གསུམ་བསླབས་ཏེ། དེ་གཉི་ག་རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བར་གྱུར་ཏེ།
en: After they went forth, they studied the Tripiṭaka and became proponents of the Dharma with all the eloquence of their wisdom and freedom.

source: དེ་གཉི་ག་གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་སྙུན་གསོས་དང་སྨན་ཟོང་རྣམས་རྙེད་པར་གྱུར་ཏོ། །
en: They acquired provisions of clothing, food, bedding, a seat, and medicines for the sick.

source: དེ་གཉི་གས་ཀྱང་སློབ་མ་ལྔ་བརྒྱ་ལྔ་བརྒྱ་བསྡུས་ནས་གཉི་ག་ཡང་འཁོར་གྱི་སློབ་དཔོན་དུ་གྱུར་ཏོ། །
en: Each of them gathered five hundred students and became a master teacher with his own retinue.

source: དེར་དེ་གཉིས་ཀྱིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “They both practiced pure conduct all their lives, and at the time of their deaths, they prayed,

source: དེ་ནས་དེ་གཉིས་ལ་སློབ་མ་རྣམས་ཀྱིས་དྲིས་པ། ཁྱེད་གཉིས་ཀྱིས་སྨོན་ལམ་ཅི་ལྟ་བུ་ཞིག་བཏབ་ཅེས་བྱས་ནས།
en: “Their students asked them, ‘What kind of prayers are you making?’

source: དེ་གཉིས་ཀྱིས་དེ་དག་ལ་རྒྱས་པར་བསྙད་དོ། །
en: They both answered in detail,

source: དེ་ནས་དེ་དག་གིས་སྨྲས་པ།
en: and then the devotees also prayed,

source: བདག་ཅག་གིས་ཀྱང་ཁྱེད་གཉིས་ལས་བརྟེན་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May we too, entrusting ourselves to the two of you, please and not displease the Blessed Buddha.

source: དེའི་ཚེ་འཁོར་གྱི་སློབ་དཔོན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི། ཀཻ་ནེ་ཡ་དང་རི་བོ་འདི་གཉིས་ཁོ་ན་ཡིན་ནོ། །
en: Those who were the master teachers of their own retinues then are none other than the sages Kaineya and Śaila.

source: དེའི་ཚེ་སློབ་མར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་དགེ་སློང་སྟོང་པོ་འདི་དག་ཉིད་ཡིན་ཏེ།
en: Those who were their students then are none other than these one thousand monks.

source: དེ་དག་གིས་དེར་སྨོན་ལམ་བཏབ་སྟེ་
en: At that time they prayed,

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ།
en: May we go forth in his doctrine, cast away all afflictive emotions, and manifest arhatship.’

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན་དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—

source: འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: that they have pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: བག་མ་གཏོང་བ་ཞེས་བྱ་བ་གཉིས་ལ།
en: The Betrothal of the Bride: Two Stories

source: བག་མ་གཏོང་བ་དང་པོ་ནི།
en: The First “Betrothal of the Bride” Story

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་མཛའ་ཞིང་བཤེས་ལ་གཅུགས་པ་གཉིས་ཤིག་འདུག་གོ། །
en: When the Blessed One was in Śrāvastī, there lived two householders who were very close friends.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་གཉིས་གཅིག་ལ་གཅིག་སྨྲས་ཏེ།
en: One day, one of them said to the other,

source: གྲོགས་པོ་བདག་ཅག་གཉིས་ཀྱིས་ཅི་ནས་མཛའ་བ་ལས་ཅུང་ཟད་ཀྱང་འབྱེ་བར་མི་འགྱུར་བར་བྱའོ། །
en: “My friend, let’s make certain that come what may, the bond between us can never be broken.”

source: ཁྱིམ་བདག་ཅིག་ཤོས་ཀྱིས་སྨྲས་པ། འོ་ན་བདག་ཅག་གཉིས་ཀྱིས་ཇི་ལྟར་བྱ།
en: “How could we do that?” asked the other householder.

source: ཁྱིམ་བདག་གཅིག་གིས་སྨྲས་པ་གཉེན་དུ་བྱའོ། །
en: “We have to become kin,” said the first.

source: ཁྱིམ་བདག་གཅིག་གིས་སྨྲས་པ། ཁྱོད་ལ་བུ་ཁྱེའུའམ་བུ་མོ་ལྟ་ཡོད་དམ།
en: “Do you have a son or daughter?” wondered the other.

source: ཁྱིམ་བདག་གཅིག་གིས་སྨྲས་པ་མེད་དོ། །
en: “No, I don’t,” said the first.

source: ཁྱིམ་བདག་གཅིག་གིས་སྨྲས་པ། འོ་ན་བདག་ལ་ཡང་བུ་ཁྱེའུ་ཡང་མེད་བུ་མོ་ཡང་མེད་ལ། ཁྱོད་ལ་ཡང་བུ་ཁྱེའུ་ཡང་མེད་བུ་མོ་ཡང་མེད་ན་བདག་ཅག་གཉིས་ཀྱིས་གཉེན་དུ་ཇི་ལྟར་བྱ།
en: “Well, if you don’t have a son or daughter and I don’t either, how will we ever be kin?” asked the other.

source: ཁྱིམ་བདག་གཅིག་གིས་སྨྲས་པ། གཉེན་བྱ་བ་ལ་རྣམ་པ་འདི་གཉིས་ཡིན་ཏེ།
en: “There are two ways to become related to someone,” replied the first,

source: སྐྱེས་ཟིན་པའི་གཉེན་དང་ད་དུང་མ་སྐྱེས་པའི་གཉེན་ནོ། །
en: “through children you’ve already borne, or through children not yet born to you.

source: བདག་ཅག་གཉིས་ལ་བུ་ཁྱེའུ་ཡང་མེད་བུ་མོ་ཡང་མེད་མོད་ཀྱི། ད་དུང་མ་སྐྱེས་པའི་གཉེན་བྱར་རུང་སྟེ་
en: Even though neither one of us has children, we could become kin through the children we’ve yet to have.

source: གལ་ཏེ་བདག་གི་བུ་ཁྱེའུ་བཙས་ལ་ཁྱོད་ཀྱི་བུ་མོ་བཙས་ན་ནི་དེ་བདག་གི་བུ་ལ་བྱིན་ཅིག །དེ་སྟེ་ཁྱོད་ཀྱི་བུ་ཁྱེའུ་བཙས་ལ་བདག་གི་བུ་མོ་བཙས་ན་ནི་
en: Say, for instance, I have a son and you have a daughter—then we betroth your daughter to my son. Or say you have a son and I have a daughter—then we betroth my daughter to your son.”

source: བདག་གིས་དེ་ཁྱོད་ཀྱི་བུ་ལ་སྦྱིན་པར་བྱའོ་ཞེས་བྱས་ནས་དེ་གཉིས་ཀྱིས་ད་དུང་མ་སྐྱེས་པའི་གཉེན་བྱས་ཏེ་སོང་ངོ་། །
en: With that they became kin, despite the fact that their children had not yet been born, and they went their separate ways.

source: དེ་ནས་ཕྱི་ཞིག་ན་གཅིག་གི་ཆུང་མ་ལ་བུ་ཆགས་པར་གྱུར་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་བྱུང་སྟེ། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས།
en: Then one day the wife of the first conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ་རིགས་དང་འཐུན་པར་མིང་བཏགས་ནས།
en: At the elaborate feast celebrating his birth they named him according to their clan,

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་ཅིག་ཤོས་ཀྱང་ཆུང་མ་དང་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: Sometime after that, as the other and his wife enjoyed themselves and coupled, his wife conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ།
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས།
en: and they raised her on milk, yogurt, butter, ghee, and milk solids.

source: དེ་གང་གི་ཚེ་ཆེན་མོར་གྱུར་པ་དང་དེས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་ཀྱང་བླངས་སོ། །
en: When she grew up she found faith in the doctrine of the Blessed One, went for refuge, and took the fundamental precepts.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེས་ཕ་མ་གཉིས་ལ་སྨྲས་པ།
en: One day she asked for her parents’ permission, saying,

source: ཡབ་ཡུམ་བདག་ནི་འདོད་པ་རྣམས་ལ་ལོངས་སྤྱོད་པའི་རྔོ་མི་ཐོགས་ཀྱིས།
en: “Mother, Father, I cannot engage in sexual relations.

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བར་གནང་བར་མཛད་དུ་གསོལ།
en: Therefore I am asking for your kind permission to go forth in the doctrine of the Blessed One.”

source: ཕ་མ་གཉིས་ཀྱིས་སྨྲས་པ། བུ་མོ་ཁྱོད་མ་སྐྱེས་པའི་སྔ་རོལ་ནས་བདག་ཅག་གཉིས་ཀྱིས་ཁྱིམ་ཐབ་ལ་བྱིན་ཟིན་གྱིས་བདག་ཅག་གཉིས་ཀྱིས་གནང་བར་བྱར་མི་རུང་ངོ་ཞེས་བྱས་པ་དང་།
en: “My child, we cannot allow that,” her parents said, “for we betrothed you to a family before you were born.”

source: བུ་མོ་དེས་ཕ་མ་གཉིས་ལ་ཡང་དང་ཡང་དུ་དུས་ཀྱིས་གསོལ་ནསདེའི་ཕ་མ་གཉིས་ཀྱིས་བསམས་པ།
en: The young woman persisted in asking over and over until her parents thought,

source: མ་ལ་བུ་མོ་འདི་ཉིད་ཀྱིས་བདག་ཅག་གི་ཚིག་མ་མཉན་ཏེ་རབ་ཏུ་འབྱུང་སྲིད་ཀྱིས་བདག་ཅག་གིས་གྱོས་སྒྱུག་ལ་སྦྲན་ཏོ་སྙམ་ནས།
en: “Alas, it may be that our daughter will disobey us and go forth. We must warn our prospective in-laws.”

source: དེ་གཉིས་ཀྱིས་དེའི་ཕ་མ་གཉིས་ལ་སྨྲས་པ། བུ་མོ་འདི་ནི་རབ་ཏུ་འབྱུང་བར་འདོད་དེ་བདག་ཅག་གཉིས་ཀྱིས་མ་མཐོང་བར་རབ་ཏུ་འབྱུང་སྲིད་ཀྱི།
en: So they said to the boy’s parents, “Our daughter wants to go forth, and it is possible she will do so in secret.

source: མ་ཐོགས་པ་ཁོ་ནར་བག་མ་ལོང་ལ་ཁྱེད་ཅག་གི་ཁྱིམ་དུ་ཁྲིད་ཅིག་ཅེས་བྱས་སོ། །
en: Do not delay in making her a bride and bringing her into your home.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱིམ་བདག་དེས་བུ་ཆས་སུ་བཅུག་སྟེ། ཁྱེའུ་དེ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ནས་འབྱོར་པ་ཆེན་པོ་དང་ལྡན་པས་གྱོས་པོའི་ཁྱིམ་དུ་བཏང་ངོ་། །
en: Now no sooner had they heard this than the householders dressed up their son and sent the young man—adorned with every type of adornment, laden with riches—to the home of his in-laws,

source: དེ་ནས་ཁྱིམ་བདག་དེས་ཀྱང་ཁྱིམ་ན་གནས་པ་རྣམས་ཀྱི་ཁྱིམ་པའི་ཆོས་བཞིན་དུ་བྱས་ནས་བུ་མོ་ཁྱིམ་ཐབ་ལ་བཏང་ངོ་། །
en: and the householders handed their daughter to him to be married, as is the custom among householders.

source: དེ་ནས་བག་མ་བླངས་ཟིན་པའི་འོག་ཏུ་བུ་མོ་དེ་བྲོས་ཏེ།
en: After he had accepted her as his bride, the young woman fled.

source: དགེ་སློང་མའི་གཙུག་ལག་ཁང་དུ་སོང་ནས་རབ་ཏུ་བྱུང་སྟེ་བསྙེན་པར་རྫོགས་སོ། །
en: She went to the nunnery, where her preceptor led her to go forth as a novice

source: མཁན་མོས་ཀྱང་དེ་ལ་ལུང་ཕོག་ནས་དེས་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས་རྫུ་འཕྲུལ་ཡང་བསྒྲུབས་ཏེ།
en: and then conferred on her full ordination and instructed her. Casting away all afflictive emotions through diligence, practice, and effort, she manifested arhatship, and even began to perform miracles.

source: དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: She became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: ཁྱེའུ་དེས་ཀྱང་ཆུང་མ་བྲོས་པ་ཐོས་ནས་ཐོས་མ་ཐག་ཏུ་གཡོག་འཁོར་མང་པོ་དག་དང་ཆས་ཏེ།
en: When the young man heard that his wife had run away, he immediately set out to look for her, accompanied by many servants.

source: ཚོལ་ཞིང་དགེ་སློང་མའི་གཙུག་ལག་ཁང་དུ་སོང་བ་ལས་ཁྱེའུ་དེས་བདག་གི་ཆུང་མ་སྐྲ་བྲེགས་ཏེ་ཆོས་གོས་ཚོན་ཅན་བགོས་ཏེ། སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་བསམ་གཏན་བྱེད་པ་མཐོང་སྟེ།
en: Arriving at the nunnery, the young man found his wife, head shaved, garbed in the colorful religious robes, sitting cross-legged in meditation.

source: མཐོང་མ་ཐག་ཏུ་དེའི་ཐད་དུ་སོང་ནས་དེས་ལག་པ་ནས་བཟུང་བར་བྱས་པ་དང་དེ་སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ནས་ འབར་བ་དང་ལམ་མེར་འདུག་པ་དང་ཆར་འབབ་པ་དང་གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་རྣམས་བསྟན་ནས
en: As soon as he saw her he went to her and took her by the hand. Just then she rose up into the sky, making a miraculous display of fire and light, rain and lightning.

source: དེ་མཐོང་མ་ཐག་ཏུ་ཁྱེའུ་དེ་དང་སྐྱེ་བོ་མང་པོ་དེ་དག་ཤས་ཆེར་དགའ་བར་གྱུར་ཏོ། །
en: At the sight of this the young man and the others gathered there experienced a surge of joy,

source: དགའ་བར་གྱུར་ནས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྨྲས་པ།
en: and in their joy they bowed down at her feet, and said, “O great fortunate one, please, please come down!

source: སྐལ་བ་ཆེན་མོ་མར་སྤྱོན་མར་སྤྱོན།
en: We’re mired in misdeeds!

source: བདག་ཅག་ཉེས་པར་སྤྱད་པའི་འདམ་དུ་བྱིང་བ་ལས་ལག་ནས་དྲང་དུ་གསོལ་ཞེས་བྱས་སོ། །
en: Please reach down and lift us up!”

source: དེ་ནས་དེ་ས་ལ་བབས་ནས་ཁྱེའུ་དེས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་བཟོད་པ་གསོལ་ནས་ཡོ་བྱད་ཐམས་ཅད་ཀྱང་བསྟབས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་དེའི་མདུན་དུ་འདུག་གོ། །
en: When she descended, the young man touched his head to her feet, asked for her forgiveness, provided for all her needs, and sat before her to listen to the Dharma.

source: དེས་ཀྱང་དེ་རྣམས་ཀྱི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་ཤེས་པ་དང་རང་བཞིན་རྟོགས་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: She realized the thoughts, habitual tendencies, temperament, capacity, and nature of the young man and the others gathered there, and taught them the Dharma accordingly.

source: དེ་ནས་ཁྱེའུ་དེ་དང་སྐྱེ་བོ་མང་པོ་དེ་དག་གིས་སྟན་དེ་དག་ཉིད་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: When they heard it, they destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: བདེན་པ་མཐོང་ནས་ཁྱེའུ་དེས་བསམས་པ།
en: Having seen the truths, the young man thought,

source: བུད་མེད་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཡོན་ཏན་གྱི་ཚོགས་འདི་ལྟ་བུ་དག་ཐོབ་པར་གྱུར་གྱིས་བདག་གིས་ཀྱང་ཁྱིམ་ན་གནས་པ་བཏང་ལ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཆུ་བོ་རྣམས་ལས་བརྒལ་བར་བྱ་བ་དང་སྦྱོར་བ་རྣམས་ལས་འདའ་བར་བྱ་བའི་ཕྱིར་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པར་བྱའོ་
en: “Since even a woman who has gone forth in the Blessed One’s teaching can achieve such a collection of great qualities as these, I should also give up my life at home and go forth in the Blessed One’s teaching so that I can ford the floodwaters and completely escape my fetters through diligence, practice, and effort.”

source: སྙམ་ནས་ཕ་མ་ལ་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས་རྫུ་འཕྲུལ་ཡང་བསྒྲུབས་ཏེ།
en: With this thought he asked for his parents’ permission and went forth in the doctrine of the Blessed One, cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: བཙུན་པ་དགེ་སློང་མ་འདིས་ལས་གང་དག་བགྱིས་ན། བག་མར་མཆིས་པའི་འོག་ཏུ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལ་
en: “what action did this nun take that after she became a bride she cast away all afflictive emotions and manifested arhatship,

source: དགེ་སློང་འདིས་ཀྱང་འདི་ཁོ་ན་ལ་བརྟེན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: and that this monk, entrusting himself to her completely, likewise cast away all afflictive emotions and manifested arhatship?”
